## Plan Result (sds_stg_ado)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.aks_mi_apintegration_contributor[0]
  * azurerm_role_assignment.aks_mi_datasharelanding_contributor[0]
  * azurerm_role_assignment.mi_adhoc_contributor[0]
  * azurerm_role_assignment.mi_audit_contributor[0]
  * azurerm_role_assignment.mi_export_contributor[0]
  * azurerm_role_assignment.mi_landing_contributor[0]
  * azurerm_role_assignment.mi_pds_contributor[0]
  * azurerm_role_assignment.mi_polybasestaging_contributor[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.aks_mi_apintegration_contributor[0] will be created
  + resource "azurerm_role_assignment" "aks_mi_apintegration_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/miapintegrationstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_mi_datasharelanding_contributor[0] will be created
  + resource "azurerm_role_assignment" "aks_mi_datasharelanding_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/midatasharelandingstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_adhoc_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_adhoc_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/miadhoclandingstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_audit_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_audit_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/miauditstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_export_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_export_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/miexportstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_landing_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_landing_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/milandingstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_pds_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_pds_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/mipersistentstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_polybasestaging_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-stg-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingstg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"sds_stg_ado","Vars":{}} -->